// Постановка задачи: Создать матрицу, состоящую из нулей, за исключением элементов, которые находятся в крайних столбцах и строках - они равны единице.
// Переменные: - m - количество строк
//             - n - количество столбцов
//             - array - двумерный массив. Хранит в себе матрицу заданного с клавиатуры размера

fun main() {
    var m = 0
    var n = 0

    // Ввод количества строк с клавиатуры
    // * ввод происходит до момент, пока не будет введено верное значение
    //----------------------------------------------------
    while (true) {
        print("Введите количство строк: ")
        m = readLine()?.toInt() ?: 0
        if (m==0)
            println("Введено некорректное значение..")
        else
            break
    }

    // Ввод количества столбцов с клавиатуры
    // * ввод происходит до момент, пока не будет введено верное значение
    //----------------------------------------------------
    while (true){
        print("Введите количство столбцов: ")
        n = readLine()?.toInt() ?: 0
        if (n==0)
            println("Введено некорректное значение..")
        else
            break
    }
    var array = Array(m){Array(n){0} }                      // создание пустого массива размерностью m*n

    // Создание массива заданной размерности (см. условия задачи)
    // ----------------------------------------------
     for (i in 0 until m){
         for (j in 0 until n){
             if ((i==0)||(i==m-1)||(j==0)||(j==n-1)){
                 array[i][j]=1
             }
             else array[i][j]=0
         }
     }

    // Вывод массива на экран
    //-----------------------------------------------
    for (i in 0 until m){
        for (j in 0 until n){
            print(String.format("%4d", array[i][j]))        // вывод строки матрицы в заданном формате (с выравниванием)
        }
        println()                                           // переход на следующую строку
    }
}