//4.1
// Постановка задачи: Разработать программу которая умеет выводить массив M x N.
//Усложнение задачи: Сделать так, чтобы можно было производить какие-либо
// операции над массивами. (К примеру чисел в массиве,
// нахождение общего знаменателя и так далее - подобные задачи
// можно найти в интернете). Для того чтобы зачесть себе в карму
// усложнение задачи, решите как минимум 5 задач с матрицами.
// val array2D = Array(rows) {Array(cols) {initialValue}}
fun main() {
    println("Введите количество строк: ")
    val m = readLine()?.toInt() ?: 0                        // перевод введённой строки в целое число, если она таковым является
    println("Введите количество столбцов: ")
    val n = readLine()?.toInt() ?: 0
    val array2D = Array(m) {Array(n) {(1..10).random()} }
    for (i in 0 until array2D.size){
        for (j in 0 until array2D[i].size)
            print(String.format("%4d", array2D[i][j]))      // выравнивание чисел в строке
        println()
    }
}